Revit 2027 API
RevitCommandId.CanHaveBinding Property
 Indicates whether the command can be assigned a binding to an external add-in.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveBinding { get; }
Public ReadOnly Property CanHaveBinding As Boolean
	Get
public:
property bool CanHaveBinding {
	bool get ();
}
member CanHaveBinding : bool with get
Property Value
Boolean
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace